#pragma once
#include <stdint.h>

typedef struct YJ_ButdCore YJ_ButdCore;

/* =========================================================
		初始化浮力装置
		return
			句柄		成功
			NULL	失败
===========================================================*/
YJ_ButdCore * YJ_ButdInit();

/* =========================================================
		反初始化浮力装置
===========================================================*/
void YJ_ButdUnInit(YJ_ButdCore * h);

/* =========================================================
		获取浮力装置状态
		return
			状态
===========================================================*/
int32_t GetButdState(YJ_ButdCore * h);

/* =========================================================
		设置浮力装置状态
		return
			1		成功
			0   失败
===========================================================*/
int32_t SetButdState(YJ_ButdCore * h, int32_t s);