#pragma once
#include "LMST_MotionCtrl.h"


 
 /*=================================================
        设置占空比参数
					return
						1				成功
						0				失败
==================================================*/
int32_t YJ_PwmSet_tail(double Sita);

 /*=================================================
        螺旋桨推进舱(ServoMotorNode) 设置占空比参数
					return
						1				成功
						0				失败
==================================================*/
int32_t YJ_PwmSet_sm(	u8 LServo, u8 RServo, u8 LMotor, u8 RMotor);

/*=================================================
        pwm模块初始化
==================================================*/
 void YJ_PwmInit(void);
 
 /*=================================================
        pwm模块反初始化
==================================================*/
void YJ_PwmUnInit(void);

 
 